Задание 1

In [87]:
import numpy as np
import pandas as pd

In [88]:
authors = pd.DataFrame({'author_id':[1, 2, 3],'author_name':['Тургенев', 'Чехов', 'Островский']},
                       columns=['author_id', 'author_name'])

In [89]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [90]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]}, columns=['author_id', 'book_title', 'price'])

In [91]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Задание 2

In [92]:
 authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')

In [93]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Задание 3

In [94]:
top5 = authors_price.nlargest(5, 'price')

In [95]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4

In [101]:
authors_stat1 = authors_price.groupby('author_name').agg({'price' : 'min'})

In [102]:
authors_stat1

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [103]:
authors_stat2 = authors_price.groupby('author_name').agg({'price' : 'min'})

In [104]:
authors_stat2

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [105]:
authors_stat3 = authors_price.groupby('author_name').agg({'price' : 'mean'})

In [106]:
authors_stat3

                  price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000